{
    "input": "Filepath for Bruker .d file containing TSF or TDF file or directory containing multiple Bruker .d files.",
    "outdir": "Path to folder in which to write output file(s). Default = none",
    "mode": "Choose whether export to spectra in \"raw\" or \"centroid\" formats. Defaults to \"centroid\".",
    "compression": "Choose between ZLIB compression (\"zlib\") or no compression (\"none\"). Defaults to \"zlib\".",
    "ms2_only": "Boolean flag that specifies only MS2 spectra should be converted.",
    "pressure_compensation_strategy": "Whether to parse data as is (\"none\"), apply global pressure compensation (\"global\"), or apply per frame pressure compensation (\"frame\"). Defaults to \"none\".",
    "exclude_mobility": "Boolean flag used to exclude trapped ion mobility spectrometry data from exported data. Precursor ion mobility information is still exported.",
    "encoding": "Choose encoding for binary arrays: 32-bit (\"32\") or 64-bit (\"64\"). Defaults to 64-bit.",
    "profile_bins": "Number of bins used to bin data when converting in profile mode. A value of 0 indicates no binning is performed. Defaults to 0.",
    "barebones_metadata": "Only use basic mzML metadata. Use if downstream data analysis tools throw errors with descriptive CV terms.",
    "maldi_output_file": "For MALDI dried droplet data, whether individual scans should be placed in individual files (\"individual\"), combined into a single file (\"combined\"), or combined by sample label (\"sample\"). Defaults to \"combined\".",
    "maldi_plate_map": "Plate map to be used for parsing spots if --maldi_output_file == \"individual\" or --maldi_output_file == \"sample\". Should be a .csv file with no header/index.",
    "imzml_mode": "Whether .imzML files should be written in \"processed\" or \"continuous\" mode. Defaults to \"processed\".",
    "verbose": "Boolean flag to determine whether to print logging output.",
    "url": "URL for server to run TIMSCONVERT (if submitting job through API). Default = localhost:5000"
}